insert into task_entity (task_title, task_text,  source_sample)
values ('ArraySort',
'Вам данн массив в 1000 символов, заполненный случайными цифрами
Ваша задача отсортировать его по возрастанию.
Напишите реализацию метода, не изменяя сигнатуру метода и уже
заданных в шаблоне переменных.',
'public int[] sort() {   int[] ar = new int[a.length];   //write your code here    return ar; }'),
('TextRefactor',
'Вам дан текст, в которой в случайном порядке
вставлен символ ''s'', вам необходимо восстановить
исходный текст и определить номер последней буквы "Ф".
Напишите реализацию метода, не изменяя сигнатуру метода и уже
заданных в шаблоне переменных.',
'public int result(String text) {  //write your code here    return text; }');